using System;

// Приведення типу (Casting або Type conversion) - це перетворення значення змінної одного типу в значенне іншого типу.
// Існує явне (explicit) і неявне (implicit) приведення типів.

namespace Casting
{
    class Program
    {
        static void Main()
        {
            //   ----------------------------------  Змінні  ---------------------------------------------

            #region Неявне (безпечне) приведення типу:

            // Неявне приведення значення типу - byte в тип int. (приведення меньшого типу в більший) 
            byte a = 10;     //                                      0000 1010  -  1 байт
            int b = 0;       //  0000 0000   0000 0000   0000 0000   0000 0000  -  4 байта
            b = a;           //  0000 0000   0000 0000   0000 0000   0000 1010  -  4 байта              

            Console.WriteLine(b);

            // Неявне приведення значення типу - int в тип float. (приведення цілого типу в дійсний) 
            int c = 255;
            float d = 0f;
            d = c;

            Console.WriteLine(d);

            #endregion

            #region Явне (небезпечне) приведення типу:

            // Явне приведення значення типу - int в тип byte. 
            // (приведення більшого типу в меньший, призводить до втрати частини результату)            

            int e = 256;     //  0000 0000   0000 0000   0000 0001   0000 0000  -  4 байта
            byte f = 0;      //                                      0000 0000  -  1 байт
            f = (byte)e;     //                                      0000 0000  -  1 байт
            // f = e;        //  ПОМИЛКА.

            Console.WriteLine(f);

            // Явне приведення значення типу - float в тип int.  
            // (приведення дійсного типу в цілий, призводить до втрати точності результату)

            float g = 10.5F;
            int h = 0;
            h = (int)g;
            // h = g;         // ПОМИЛКА.

            Console.WriteLine(h);

            #endregion

            //   ----------------------------------  Константи  ----------------------------------------------

            #region Кастинг констант

            // Можливо неявне перетворення значення константи типу - int в тип byte,
            // при ініціалізації змінної значенням константи,
            // якщо значення константи не перевищує максимально допустимого значення змінної.

            const int i = 255;  //  0000 0000   0000 0000   0000 0000   1111 1111  -  4 байта
            byte j = 0;         //                                      0000 0000  -  1 байт
            j = i;              //                                      1111 1111  -  1 байт

            Console.WriteLine(j);

            // Можливо явне перетворення значення константи типу - float в тип byte,
            // при ініціалізації змінної значенням константи,
            // якщо значення константи не перевищує максимально допустимого значення змінної.

            const float k = 255;
            byte l = 0;
            l = (byte)k;

            Console.WriteLine(l);

            // Неможливо ні явне, ні неявне перетворення значення константи,
            // при ініціалізації змінної значенням константи,
            // якщо значення константи перевищує максимально допустимий діапазон значення змінної.

            const int m = 256;  //  0000 0000   0000 0000   0000 0001   0000 0000  -  4 байта
            byte n = 0;         //                                      0000 0000  -  1 байт
            // n = m;           //  ПОМИЛКА.
            // n = (byte)m;     //  ПОМИЛКА.

            Console.WriteLine(n);

            // Неможливо ні явне, ні неявне перетворення значення дісної константи,
            // при ініціалізації цілочисельної змінної значенням константи,
            // якщо значення константи перевищує максимально допустимий діапазон значення змінної.

            const float o = (float)256.5; // перетворення double в float
            byte p = 0;
            // p = o;           //  ПОМИЛКА.
            // p = (byte)o;     //  ПОМИЛКА.

            Console.WriteLine(p);
            
            #endregion
            
            // Затримка.
            Console.ReadKey();
        }
    }
}
