using System;

// Константа (Constant) - це область памяті, яка зберігає у собі значення, яке не можна змінити. При спробі змінити буде помилка.

namespace Constant
{
    class Program
    {
        static void Main()
        {
            // На 13-й стрічці, створюємо константу з іменем pi, типу double і присвоюємо їй значення 3.141

            const double pi = 3.141;

            // На 17-й стрічці, виводимо значення константи - pi, на екран.

            Console.WriteLine(pi);

            // Спроба присвоїти константі нове значення, приведе до помилки на рівні компіляції!

            //pi = 2.71828183; 

            // Затримка.
            Console.ReadKey();
        }
    }
}
